## "Вывод в файл: Пирамида"

### Задание

Выведите в файл **pyramid.txt** пирамиду из n строк.

Пример:
```
n = 5
    *
   ***
  *****
 *******
*********
```
```
n = 6
     *
    ***
   *****
  *******
 *********
***********
```
**Пояснение**: в каждой строке символов на два больше, чем в предыдущей, символы выровнены по центру по длине самой нижней строки.
### Формат входных данных

Дано целое положительное число, высота(количество строк) пирамиды.

### Формат выходных данных

Программа ничего не выводит в терминал, все символы для отображения пирамиды выводим в файл.

### Решение задачи

```python
n = int(input("n: "))
lines = [i for i in range(1, n+1)]
#print(lines)
line = "*"
symbols = 1
with open ('pyramid', 'a') as f:
    for i in lines:
        #print(f"{line * symbols:^{n*2}}")
        f.write(f"{line * symbols:^{n * 2}}" + '\n')
        symbols +=2
```

---
<details>
<summary>Подсказка-1</summary>
Вспомните про форматирование строк

```python
line = "**"
print(f"{line:^8}")
```
</details>
