## "Бесконечный ввод и подсчет положительных"

### Задание

С клавиатуры вводятся целые числа, до тех пор пока не будет введена строка "стоп". \
Посчитайте количество положительных чисел, среди введенных.

### Формат входных данных

Вводятся целые числа, пока не будет введено "стоп".

### Формат выходных данных

Вывести количество положительных.

### Решение задачи

```python
needed_value = "stop"
print("Для окончания программы введите", needed_value)
input_value = ""
values =[]
while needed_value != input_value:
    input_value = input("value: ")
    if type(input_value) == int  and  input_value > 0:
        values.append(input_value)
print(len(values))
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотри пример "Выполнение цикла пока не будет введено нужное значение"
</details>
