## "Подсчет символов"

### Задание

Подсчитать количество букв «б» во введенной строке

### Формат входных данных

Дана произвольная строка.

### Формат выходных данных

Вывести количество найденных букв.

### Решение задачи

```python
text = (input())
с =0

for i in text:
    if i == 'б':
        с +=1
print (с)
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Для решения задачи найдите подходящий метод строки.
</details>
