## "Высокооплачиваемые сотрудники"

### Задание
В файле [data/salaries.txt](data/salaries.txt) даны зарплаты сотрудников.

Выведите всех сотрудников в файл highly_paid.txt, зарплаты которых превышают 60000. \
Формат вывода смотри в "Формат выходных данных"

### Формат входных данных

Дан текстовый файл. \
В первой строке указаны названия параметров сотрудника. \
В каждой следующей строке дана информация о сотруднике.

### Формат выходных данных

Записать информацию в файл highly_paid.txt о сотрудниках с зарплатой выше 60000.

Сотрудников вывести в формате: Фамилия И.О., \
например: **Иванов И.П.** (зарплаты в выходной файл не записывать)

### Решение задачи

```python
stroka = []
with open('sal', "r", encoding='UTF-8') as f:
    for line in f:
        stroka = line.split()
        try:
            if int(stroka[3]) > 60000:
                with open('highly_paid.txt', 'a', encoding='UTF-8') as f2:
                    f2.write(f'{stroka[0]} {stroka[1][1].upper()}.{stroka[2][1].upper()}. \n')
                #print(f'{stroka[0]} {stroka[1][1].upper()}.{stroka[2][1].upper()}. ')
        except:
            pass
```

---
